course2reg.org
#+TITLE: Notes on Coursera, Deep Learning Specification, Improving Deep Neural Networks: Hyperparameter Tuning, Regularization and Optimization, 2020
#+AUTHOR: By Me
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: H:10


* Introduction

This week: more practical aspects. 

Applied machine learning is a highly iterative process. Almost impossible to initially guess the right values for #layers, #hidden units, learning rates, activation functions, ...

Intuitions for hyperparameters from one application area often do not transfer well to other areas. 

Divide data into development set, cross-validation or dev set, and test set.

Previously in machine learning: 60/20/20 best practice. Up to 10k examples these ratios are good. In modern 'big data era' the trend is to increase the training set size. For example, 1,000,000 / 10,000 / 10,000 i.e. ~98/1/1 

Recently, mismatched train/test set distributions. Rule of thumb: dev set and test set still from the same distribution. Mismatch is (I think) not a goal in itself but sometimes necessary to have enough training data. 

Sometimes teams only use train/test or train/dev sets. 

* Week 1 

** Bias and Variance

There is more nuance to bias/variance than you might expect! 

We're talking less about trade-off, tho. 

In general: High bias leads to underfitting, high variance leads to overfitting. 

Two key measure to look at: Training set error, Dev set error. Example. 1%/11%. Looks like overfitting, i.e. high variance. Example. 15%/16% looks like underfitting, i.e. high bias.

|                 | high variance | high variance | high bias & variance | low bias & variance |
|-----------------+---------------+---------------+----------------------+---------------------|
| train set error |            1% |           15% |                  15% |                0.5% |
| dev set error   |           11% |           16% |                  30% |                  1% |

human roughly 0%. More generally, the optimal (Bayes) error is close to 0% IN THIS CASE OF looking at cats v. dogs.

How much higher the error goes from the training to the dev set gives you an idea about high variance.

** Basic Recipe for Machine Learning

Ask: 
1) High bias? check Training data performance. If yes, try a bigger network. Or train longer. Or try a different network architecture. More training data doesn't help much.
2) High Variance? Check dev set performance. If yes, try more data, use regularization, or try a different network architecture.
Done.

In earlier days, there was much talk about bias variance tradeoff. In the modern era, a bigger network and more data almost always reduces your bias and variance. This has been one of the big reasons deep learning has been so successful recently.

** Regularization

If you suspect overfitting, first thing to try is regularization.

Add to the logistic regression cost function a regularization term lambda:

$$J(w,b) = \frac{1}{m} \sum_{i=1}^m \mathcal{l}(\hat{y}^{(i)},y^{(i)}) + \frac{\lambda}{2m} ||w||^2_2$$

$L_2$ regularization

$$||w||^2_2 = \sum_{j=1}^{n_x} w_j^2 = w^Tw$$

We don't regularize $b$, it just doesn't matter as much.

$L_1$ regularization is $||w||_1$, then $w$ will be sparse. $L_2$ is used more often.

$\lambda$ is the regularization parameter. 

*** Regularization in Neural Networks

Add a lambda term to the cost function as well:

$$J(W^^{[1]},b^{[1]},\dots,\W^{[l]},b^{[l]}) = \frac{1}{m}\mathcal{L}(\hat{y}^{(i)},y^{[i]}) + \frac{\lambda}{2m} \sum^{l}_{l=1}||w^{[l]}||^2_F$$
$$||w^{[l]}||^2_F = \sum_{i=1}^{n^{[l]}} \sum_{j=1}^{n^{[l-1]}} (w^{[l]}_{i,j})^2$$

Then
$$dW^{[l]} = \dots + \frac{\lambda}{m} W^{[l]}$$

Alternative name is /weight decay/.

** Why does Regularization Prevent Overfitting?

It puts a dampener on the weights: Even if the predictions are basically perfect, high weights still contribute to the loss function we are trying to minimize. To the effect that many weights are almost zero. So basically, we have a simpler network which is less prone to overfitting.

Another attempt: for small weights you get roughly linear activation functions (e.g. tanh is roughly linear around 0), which makes for a much simpler network (that basically just implements a single logistic regression).

** Dropout Regularization

Another very powerful regularization is dropout. The idea is to, on each batch of training examples or per iteration, 'drop out' different nodes and completely ignore them in the training process. 

How to implement? Create a boolean matrix with random < keep_probability, so you zero out random elements when multiplying with activation matrix. This is called inverted dropout technique. 

#+BEGIN_SRC python
d3 = np.random.rand(a3.shape[0],a3.shape[1]) < keep_prob
a3 = np.multiply(a3,d3)
#+END_SRC

You don't use drop out at test time. But why does it work?

