course2reg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-26 Mo 16:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes on Coursera, Deep Learning Specification, Improving Deep Neural Networks: Hyperparameter Tuning, Regularization and Optimization</title>
<meta name="author" content="By Me" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Notes on Coursera, Deep Learning Specification, Improving Deep Neural Networks: Hyperparameter Tuning, Regularization and Optimization</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org36ca5ba">1. Introduction</a></li>
<li><a href="#org2673104">2. Week 1</a>
<ul>
<li><a href="#org8301b19">2.1. Bias and Variance</a></li>
<li><a href="#org6804f20">2.2. Basic Recipe for Machine Learning</a></li>
<li><a href="#org3dfff89">2.3. Regularization</a>
<ul>
<li><a href="#org0ac8807">2.3.1. Regularization in Neural Networks</a></li>
</ul>
</li>
<li><a href="#orgfc47e6a">2.4. Why does Regularization Prevent Overfitting?</a></li>
<li><a href="#org31b4ba9">2.5. Dropout Regularization</a></li>
<li><a href="#org4b7744d">2.6. Why does Drop-out work?</a></li>
<li><a href="#org8ffffbc">2.7. Other Regularization Methods</a></li>
<li><a href="#org8335902">2.8. Normalizing Inputs</a></li>
<li><a href="#orgcb07e09">2.9. Vanishing / Exploding Gradients</a></li>
<li><a href="#orge09a055">2.10. Weight Initialization for Deep Networks</a></li>
<li><a href="#org8c2189c">2.11. Numerical approximation of gradients</a></li>
<li><a href="#org80baefb">2.12. Gradient Checking</a></li>
<li><a href="#org7a24e40">2.13. Gradient Checking Implementation Notes</a></li>
<li><a href="#org40fcf02">2.14. Notes from the programming exercise</a></li>
</ul>
</li>
<li><a href="#orgb3dab38">3. Week 2</a>
<ul>
<li><a href="#org08c56ce">3.1. Notes from the Python Notebook</a></li>
</ul>
</li>
<li><a href="#org6f849fe">4. Week 3 Hyperparameter tuning, Regularization and Optimization</a>
<ul>
<li><a href="#org5219bb7">4.1. Tuning Process</a></li>
<li><a href="#org6ce08ae">4.2. Appropriate Scale for Hyperparameters</a></li>
<li><a href="#org9780be9">4.3. Hyperparameter Tuning in Practice: Pandas vs. Caviar</a></li>
<li><a href="#org6955b79">4.4. Normalizing Activations in a Network</a></li>
<li><a href="#orga14fb84">4.5. Fitting Batch Norm into a Neural Network</a></li>
<li><a href="#orgbcab631">4.6. Why does Batch Norm Work?</a></li>
<li><a href="#orga2c00c9">4.7. Batch Norm at Test Time</a></li>
<li><a href="#orgacfb86f">4.8. Softmax Regression</a></li>
<li><a href="#org595dc1d">4.9. Training a Softmax Classifier</a></li>
<li><a href="#org46ddfa6">4.10. Deep Learning Frameworks</a></li>
<li><a href="#org861c3c5">4.11. Tensorflow</a></li>
<li><a href="#orgd0600b9">4.12. Notes from the Notebook</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org36ca5ba" class="outline-2">
<h2 id="org36ca5ba"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This week: more practical aspects. 
</p>

<p>
Applied machine learning is a highly iterative process. Almost impossible to initially guess the right values for #layers, #hidden units, learning rates, activation functions, &#x2026;
</p>

<p>
Intuitions for hyperparameters from one application area often do not transfer well to other areas. 
</p>

<p>
Divide data into development set, cross-validation or dev set, and test set.
</p>

<p>
Previously in machine learning: 60/20/20 best practice. Up to 10k examples these ratios are good. In modern &rsquo;big data era&rsquo; the trend is to increase the training set size. For example, 1,000,000 / 10,000 / 10,000 i.e. ~98/1/1 
</p>

<p>
Recently, mismatched train/test set distributions. Rule of thumb: dev set and test set still from the same distribution. Mismatch is (I think) not a goal in itself but sometimes necessary to have enough training data. 
</p>

<p>
Sometimes teams only use train/test or train/dev sets. 
</p>
</div>
</div>

<div id="outline-container-org2673104" class="outline-2">
<h2 id="org2673104"><span class="section-number-2">2.</span> Week 1</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8301b19" class="outline-3">
<h3 id="org8301b19"><span class="section-number-3">2.1.</span> Bias and Variance</h3>
<div class="outline-text-3" id="text-2-1">
<p>
There is more nuance to bias/variance than you might expect! 
</p>

<p>
We&rsquo;re talking less about trade-off, tho. 
</p>

<p>
In general: High bias leads to underfitting, high variance leads to overfitting. 
</p>

<p>
Two key measure to look at: Training set error, Dev set error. Example. 1%/11%. Looks like overfitting, i.e. high variance. Example. 15%/16% looks like underfitting, i.e. high bias.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">high variance</th>
<th scope="col" class="org-right">high variance</th>
<th scope="col" class="org-right">high bias &amp; variance</th>
<th scope="col" class="org-right">low bias &amp; variance</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">train set error</td>
<td class="org-right">1%</td>
<td class="org-right">15%</td>
<td class="org-right">15%</td>
<td class="org-right">0.5%</td>
</tr>

<tr>
<td class="org-left">dev set error</td>
<td class="org-right">11%</td>
<td class="org-right">16%</td>
<td class="org-right">30%</td>
<td class="org-right">1%</td>
</tr>
</tbody>
</table>

<p>
human roughly 0%. More generally, the optimal (Bayes) error is close to 0% IN THIS CASE OF looking at cats v. dogs.
</p>

<p>
How much higher the error goes from the training to the dev set gives you an idea about high variance.
</p>
</div>
</div>

<div id="outline-container-org6804f20" class="outline-3">
<h3 id="org6804f20"><span class="section-number-3">2.2.</span> Basic Recipe for Machine Learning</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Ask: 
</p>
<ol class="org-ol">
<li>High bias? check Training data performance. If yes, try a bigger network. Or train longer. Or try a different network architecture. More training data doesn&rsquo;t help much.</li>
<li>High Variance? Check dev set performance. If yes, try more data, use regularization, or try a different network architecture.</li>
</ol>
<p>
Done.
</p>

<p>
In earlier days, there was much talk about bias variance tradeoff. In the modern era, a bigger network and more data almost always reduces your bias and variance. This has been one of the big reasons deep learning has been so successful recently.
</p>
</div>
</div>

<div id="outline-container-org3dfff89" class="outline-3">
<h3 id="org3dfff89"><span class="section-number-3">2.3.</span> Regularization</h3>
<div class="outline-text-3" id="text-2-3">
<p>
If you suspect overfitting, first thing to try is regularization.
</p>

<p>
Add to the logistic regression cost function a regularization term lambda:
</p>

<p>
\[J(w,b) = \frac{1}{m} \sum_{i=1}^m \mathcal{l}(\hat{y}^{(i)},y^{(i)}) + \frac{\lambda}{2m} ||w||^2_2\]
</p>

<p>
\(L_2\) regularization
</p>

<p>
\[||w||^2_2 = \sum_{j=1}^{n_x} w_j^2 = w^Tw\]
</p>

<p>
We don&rsquo;t regularize \(b\), it just doesn&rsquo;t matter as much.
</p>

<p>
\(L_1\) regularization is \(||w||_1\), then \(w\) will be sparse. \(L_2\) is used more often.
</p>

<p>
\(\lambda\) is the regularization parameter. 
</p>
</div>

<div id="outline-container-org0ac8807" class="outline-4">
<h4 id="org0ac8807"><span class="section-number-4">2.3.1.</span> Regularization in Neural Networks</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Add a lambda term to the cost function as well:
</p>

<p>
\[J(W^^{[1]},b^{[1]},\dots,\W^{[l]},b^{[l]}) = \frac{1}{m}\mathcal{L}(\hat{y}^{(i)},y^{[i]}) + \frac{\lambda}{2m} \sum^{l}_{l=1}||w^{[l]}||^2_F\]
\[||w^{[l]}||^2_F = \sum_{i=1}^{n^{[l]}} \sum_{j=1}^{n^{[l-1]}} (w^{[l]}_{i,j})^2\]
</p>

<p>
Then
\[dW^{[l]} = \dots + \frac{\lambda}{m} W^{[l]}\]
</p>

<p>
Alternative name is <i>weight decay</i>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgfc47e6a" class="outline-3">
<h3 id="orgfc47e6a"><span class="section-number-3">2.4.</span> Why does Regularization Prevent Overfitting?</h3>
<div class="outline-text-3" id="text-2-4">
<p>
It puts a dampener on the weights: Even if the predictions are basically perfect, high weights still contribute to the loss function we are trying to minimize. To the effect that many weights are almost zero. So basically, we have a simpler network which is less prone to overfitting.
</p>

<p>
Another attempt: for small weights you get roughly linear activation functions (e.g. tanh is roughly linear around 0), which makes for a much simpler network (that basically just implements a single logistic regression).
</p>
</div>
</div>

<div id="outline-container-org31b4ba9" class="outline-3">
<h3 id="org31b4ba9"><span class="section-number-3">2.5.</span> Dropout Regularization</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Another very powerful regularization is dropout. The idea is to, on each batch of training examples or per iteration, &rsquo;drop out&rsquo; different nodes and completely ignore them in the training process. 
</p>

<p>
How to implement? Create a boolean matrix with random &lt; keep<sub>probability</sub>, so you zero out random elements when multiplying with activation matrix. This is called inverted dropout technique. 
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #dcaeea;">d3</span> = np.random.rand(a3.shape[<span style="color: #da8548; font-weight: bold;">0</span>],a3.shape[<span style="color: #da8548; font-weight: bold;">1</span>]) &lt; keep_prob
<span style="color: #dcaeea;">a3</span> = np.multiply(a3,d3)
</pre>
</div>

<p>
You don&rsquo;t use drop out at test time. But why does it work?
</p>
</div>
</div>
