course2reg.org
** Why does Drop-out work?

With dropout, sometimes the inputs get eliminated. This way, a single input won't have as much influence. Drop-out has a similar effect to $L_2$-regularization. So the network has to spread out weights. The keep_prob can also vary per layer.

Downside: Cost function isn't well defined anymore, harder to calculate. Check that everything is working before adding drop-out!

** Other Regularization Methods

- Add to your training data by adding additional, distorted examples, i.e. mirroring, stretching, rotating images etc.
- Early stopping stops the training early, before dev and training error diverge too hard (if at all). Has the downside that ...

Machine Learning problem can be seen as optimizing J, while not overfitting. If these tasks are seen independent that's called orthogonalization. Now, Early stopping couples both tasks!  

** Normalizing Inputs

- Subtract the mean 
- Normalize variance: divide by standard deviation.

$$\sigma^2 = \frac{1}{m} \sum_{i=1}^m x^{(i)}**2$$

Why normalize inputs? The values for the parameters will take on very different values, which can negatively affect gradient descent. 

** Vanishing / Exploding Gradients

This is a prominent problem. Suppose you have a quite deep network with parameters $W^{[1]}, \dots, W^{[l]}$ and a linear activation function $g(z) = z$. Then $\hat{y} = W^{[l]}\dots W^{[1]}x$. With 
$$W^{[1]} = \dots = W^{[l]} = \begin{bmatrix}1.5 & 0 \\ 0 & 1.5 \end{bmatrix}$$
we have $\hat{y} = 1.5^{[L-1]}x$, so y explodes. Similarly, with 
$$W^{[1]} = \dots = W^{[l]} = \begin{bmatrix}0.5 & 0 \\ 0 & 0.5 \end{bmatrix}$$
$\hat{y}$ will vanish. 

With weights a little bit bigger than 1 the activation increases exponentially, with smaller with 1 the activations will vanish exponentially. Similarly, the *gradients* are affected. 

For a long time, this problem was a huge barrier to success.

** Weight Initialization for Deep Networks

A partial solution to the vanishing/exploding gradient problem: carefully initializing your weights. 

if $z = w_1x + \dots + w_nx_n$, you'd want for larger $n$ have smaller $w_i$. For example, set $Var(w_i) = 1/n$. E.g. for ReLU:

#+BEGIN_SRC python
Wl = np.random.randn(shape) * np.sqrt(2/(nl1))
#+END_SRC
Where ~Wl~ is $W^{[l]}$ and ~nl1~ is $n^{[l-1]}$.

Other formulas apply for other activation functions, here completely without justification except /it works/.

This doesn't /solve/ the problem, but reduces it. 

** Numerical approximation of gradients

Gradient checking helps you get all the details right. First, numerically approximate the gradient. The following gives you an approximation:

$$\frac{f(\theta + \epsilon) - f(\theta - \epsilon}{2\epsilon}} \sim g(\theta)$$

** Gradient Checking

This technique helped Andrew tons of times.

Take $W^{[i]},b^{[i]}$ and reshape into big vector $\theta$. Take $dW^{[i]},db^{[i]}$ and reshape into big vector $d\theta$.

Question: Is $d\theta$ the gradient of $J$? (That's grad check)

#+BEGIN_SRC python
for each i:
  d_theta_approx[i] = (J(theta_1,...,theta_i+epsilon,...,theta_k) - J(theta_1,...,theta_i-epsilon,...,theta_k)) / (2*epsilon)

Then check euclidean distance between two vectors $d\theta_{app}$ and $d\theta$. It should be around epsilon! E.g. $\epsilon = 10^{-7}$ then $10^{[-5]}$ ok, $but 10^{[-3]}$ bad!

But how to actually implement this son of a bitch?

** Gradient Checking Implementation Notes

- Don't use in training - only to debug.
- Remember regularization!
- Doesn't work together with dropout. Use separately.
- Run at random initialization and also maybe later again.

