course2reg.html

<div id="outline-container-org4b7744d" class="outline-3">
<h3 id="org4b7744d"><span class="section-number-3">2.6.</span> Why does Drop-out work?</h3>
<div class="outline-text-3" id="text-2-6">
<p>
With dropout, sometimes the inputs get eliminated. This way, a single input won&rsquo;t have as much influence. Drop-out has a similar effect to $L<sub>2</sub>$-regularization. So the network has to spread out weights. The keep<sub>prob</sub> can also vary per layer.
</p>

<p>
Downside: Cost function isn&rsquo;t well defined anymore, harder to calculate. Check that everything is working before adding drop-out!
</p>
</div>
</div>

<div id="outline-container-org8ffffbc" class="outline-3">
<h3 id="org8ffffbc"><span class="section-number-3">2.7.</span> Other Regularization Methods</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>Add to your training data by adding additional, distorted examples, i.e. mirroring, stretching, rotating images etc.</li>
<li>Early stopping stops the training early, before dev and training error diverge too hard (if at all). Has the downside that &#x2026;</li>
</ul>

<p>
Machine Learning problem can be seen as optimizing J, while not overfitting. If these tasks are seen independent that&rsquo;s called orthogonalization. Now, Early stopping couples both tasks!  
</p>
</div>
</div>

<div id="outline-container-org8335902" class="outline-3">
<h3 id="org8335902"><span class="section-number-3">2.8.</span> Normalizing Inputs</h3>
<div class="outline-text-3" id="text-2-8">
<ul class="org-ul">
<li>Subtract the mean</li>
<li>Normalize variance: divide by standard deviation.</li>
</ul>

<p>
\[\sigma^2 = \frac{1}{m} \sum_{i=1}^m x^{(i)}**2\]
</p>

<p>
Why normalize inputs? The values for the parameters will take on very different values, which can negatively affect gradient descent. 
</p>
</div>
</div>

<div id="outline-container-orgcb07e09" class="outline-3">
<h3 id="orgcb07e09"><span class="section-number-3">2.9.</span> Vanishing / Exploding Gradients</h3>
<div class="outline-text-3" id="text-2-9">
<p>
This is a prominent problem. Suppose you have a quite deep network with parameters \(W^{[1]}, \dots, W^{[l]}\) and a linear activation function \(g(z) = z\). Then \(\hat{y} = W^{[l]}\dots W^{[1]}x\). With 
\[W^{[1]} = \dots = W^{[l]} = \begin{bmatrix}1.5 & 0 \\ 0 & 1.5 \end{bmatrix}\]
we have \(\hat{y} = 1.5^{[L-1]}x\), so y explodes. Similarly, with 
\[W^{[1]} = \dots = W^{[l]} = \begin{bmatrix}0.5 & 0 \\ 0 & 0.5 \end{bmatrix}\]
\(\hat{y}\) will vanish. 
</p>

<p>
With weights a little bit bigger than 1 the activation increases exponentially, with smaller with 1 the activations will vanish exponentially. Similarly, the <b>gradients</b> are affected. 
</p>

<p>
For a long time, this problem was a huge barrier to success.
</p>
</div>
</div>

<div id="outline-container-orge09a055" class="outline-3">
<h3 id="orge09a055"><span class="section-number-3">2.10.</span> Weight Initialization for Deep Networks</h3>
<div class="outline-text-3" id="text-2-10">
<p>
A partial solution to the vanishing/exploding gradient problem: carefully initializing your weights. 
</p>

<p>
if \(z = w_1x + \dots + w_nx_n\), you&rsquo;d want for larger \(n\) have smaller \(w_i\). For example, set \(Var(w_i) = 1/n\). E.g. for ReLU:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #dcaeea;">Wl</span> = np.random.randn(shape) * np.sqrt(<span style="color: #da8548; font-weight: bold;">2</span>/(nl1))
</pre>
</div>
<p>
Where <code>Wl</code> is \(W^{[l]}\) and <code>nl1</code> is \(n^{[l-1]}\).
</p>

<p>
Other formulas apply for other activation functions, here completely without justification except <i>it works</i>.
</p>

<p>
This doesn&rsquo;t <i>solve</i> the problem, but reduces it. 
</p>
</div>
</div>

<div id="outline-container-org8c2189c" class="outline-3">
<h3 id="org8c2189c"><span class="section-number-3">2.11.</span> Numerical approximation of gradients</h3>
<div class="outline-text-3" id="text-2-11">
<p>
Gradient checking helps you get all the details right. First, numerically approximate the gradient. The following gives you an approximation:
</p>

<p>
\[\frac{f(\theta + \epsilon) - f(\theta - \epsilon}{2\epsilon}} \sim g(\theta)\]
</p>
</div>
</div>

<div id="outline-container-org80baefb" class="outline-3">
<h3 id="org80baefb"><span class="section-number-3">2.12.</span> Gradient Checking</h3>
<div class="outline-text-3" id="text-2-12">
<p>
This technique helped Andrew tons of times.
</p>

<p>
Take \(W^{[i]},b^{[i]}\) and reshape into big vector \(\theta\). Take \(dW^{[i]},db^{[i]}\) and reshape into big vector \(d\theta\).
</p>

<p>
Question: Is \(d\theta\) the gradient of \(J\)? (That&rsquo;s grad check)
</p>

<p>
#+BEGIN<sub>SRC</sub> python
for each i:
  d<sub>theta</sub><sub>approx</sub>[i] = (J(theta<sub>1,&#x2026;,theta</sub><sub>i</sub>+epsilon,&#x2026;,theta<sub>k</sub>) - J(theta<sub>1,&#x2026;,theta</sub><sub>i</sub>-epsilon,&#x2026;,theta<sub>k</sub>)) / (2*epsilon)
</p>

<p>
Then check euclidean distance between two vectors \(d\theta_{app}\) and \(d\theta\). It should be around epsilon! E.g. \(\epsilon = 10^{-7}\) then \(10^{[-5]}\) ok, \(but 10^{[-3]}\) bad!
</p>

<p>
But how to actually implement this son of a bitch?
</p>
</div>
</div>

<div id="outline-container-org7a24e40" class="outline-3">
<h3 id="org7a24e40"><span class="section-number-3">2.13.</span> Gradient Checking Implementation Notes</h3>
<div class="outline-text-3" id="text-2-13">
<ul class="org-ul">
<li>Don&rsquo;t use in training - only to debug.</li>
<li>Remember regularization!</li>
<li>Doesn&rsquo;t work together with dropout. Use separately.</li>
<li>Run at random initialization and also maybe later again.</li>
</ul>
</div>
</div>
