course2reg.html

<div id="outline-container-org40fcf02" class="outline-3">
<h3 id="org40fcf02"><span class="section-number-3">2.14.</span> Notes from the programming exercise</h3>
<div class="outline-text-3" id="text-2-14">
<p>
In general, initializing all the weights to zero results in the network failing to break symmetry. This means that every neuron in each layer will learn the same thing, and you might as well be training a neural network with \(n^{[l]}=1\) for every layer, and the network is no more powerful than a linear classifier such as logistic regression. 
</p>

<p>
<b><b>What you should remember</b></b>:
</p>
<ul class="org-ul">
<li>The weights \(W^{[l]}\) should be initialized randomly to break symmetry.</li>
<li>It is however okay to initialize the biases \(b^{[l]}\) to zeros. Symmetry is still broken so long as \(W^{[l]}\) is initialized randomly.</li>
</ul>

<p>
<b><b>In summary</b></b>:
</p>
<ul class="org-ul">
<li>Initializing weights to very large random values does not work well.</li>
<li>Hopefully intializing with small random values does better. The important question is: how small should be these random values be? Lets find out in the next part!</li>
</ul>

<p>
<b><b>What you should remember from this notebook</b></b>:
</p>
<ul class="org-ul">
<li>Different initializations lead to different results</li>
<li>Random initialization is used to break symmetry and make sure different hidden units can learn different things</li>
<li>Don&rsquo;t intialize to values that are too large</li>
<li>He initialization works well for networks with ReLU activations.</li>
</ul>

<p>
<b><b>Observations</b></b>:
</p>
<ul class="org-ul">
<li>The value of \(\lambda\) is a hyperparameter that you can tune using a dev set.</li>
<li>L2 regularization makes your decision boundary smoother. If \(\lambda\) is too large, it is also possible to &ldquo;oversmooth&rdquo;, resulting in a model with high bias.</li>
</ul>

<p>
<b><b>What is L2-regularization actually doing?</b></b>:
</p>

<p>
L2-regularization relies on the assumption that a model with small weights is simpler than a model with large weights. Thus, by penalizing the square values of the weights in the cost function you drive all the weights to smaller values. It becomes too costly for the cost to have large weights! This leads to a smoother model in which the output changes more slowly as the input changes. 
</p>

<p>
<b><b>What you should remember</b></b> &#x2013; the implications of L2-regularization on:
</p>
<ul class="org-ul">
<li>The cost computation:
<ul class="org-ul">
<li>A regularization term is added to the cost</li>
</ul></li>
<li>The backpropagation function:
<ul class="org-ul">
<li>There are extra terms in the gradients with respect to weight matrices</li>
</ul></li>
<li>Weights end up smaller (&ldquo;weight decay&rdquo;): 
<ul class="org-ul">
<li>Weights are pushed to smaller values.</li>
</ul></li>
</ul>

<p>
Note: the ipython notebook has a very good illustration of dropout regularization, with videos.
</p>

<p>
`When you shut some neurons down, you actually modify your model. The idea behind drop-out is that at each iteration, you train a different model that uses only a subset of your neurons. With dropout, your neurons thus become less sensitive to the activation of one other specific neuron, because that other neuron might be shut down at any time. 
</p>

<p>
<b><b>Note</b></b>:
</p>
<ul class="org-ul">
<li>A <b><b>common mistake</b></b> when using dropout is to use it both in training and testing. You should use dropout (randomly eliminate nodes) only in training.</li>
<li>Deep learning frameworks like [tensorflow](<a href="https://www.tensorflow.org/api_docs/python/tf/nn/dropout">https://www.tensorflow.org/api_docs/python/tf/nn/dropout</a>), [PaddlePaddle](<a href="http://doc.paddlepaddle.org/release_doc/0.9.0/doc/ui/api/trainer_config_helpers/attrs.html">http://doc.paddlepaddle.org/release_doc/0.9.0/doc/ui/api/trainer_config_helpers/attrs.html</a>), [keras](<a href="https://keras.io/layers/core/#dropout">https://keras.io/layers/core/#dropout</a>) or [caffe](<a href="http://caffe.berkeleyvision.org/tutorial/layers/dropout.html">http://caffe.berkeleyvision.org/tutorial/layers/dropout.html</a>) come with a dropout layer implementation. Don&rsquo;t stress - you will soon learn some of these frameworks.</li>
</ul>

<p>
<b><b>What you should remember about dropout:</b></b>
</p>
<ul class="org-ul">
<li>Dropout is a regularization technique.</li>
<li>You only use dropout during training. Don&rsquo;t use dropout (randomly eliminate nodes) during test time.</li>
<li>Apply dropout both during forward and backward propagation.</li>
<li>During training time, divide each dropout layer by keep<sub>prob</sub> to keep the same expected value for the activations. For example, if keep<sub>prob</sub> is 0.5, then we will on average shut down half the nodes, so the output will be scaled by 0.5 since only the remaining half are contributing to the solution. Dividing by 0.5 is equivalent to multiplying by 2. Hence, the output now has the same expected value. You can check that this works even when keep<sub>prob</sub> is other values than 0.5.</li>
</ul>

<p>
<b><b>What we want you to remember from this notebook</b></b>:
</p>
<ul class="org-ul">
<li>Regularization will help you reduce overfitting.</li>
<li>Regularization will drive your weights to lower values.</li>
<li>L2 regularization and Dropout are two very effective regularization techniques.</li>
</ul>

<p>
Backpropagation computes the gradients \(\frac{\partial J}{\partial \theta}\), where \(\theta\) denotes the parameters of the model. \(J\) is computed using forward propagation and your loss function.
</p>

<p>
Because forward propagation is relatively easy to implement, you&rsquo;re confident you got that right, and so you&rsquo;re almost  100% sure that you&rsquo;re computing the cost \(J\) correctly. Thus, you can use your code for computing \(J\) to verify the code for computing \(\frac{\partial J}{\partial \theta}\). 
</p>

<p>
Let&rsquo;s look back at the definition of a derivative (or gradient):
\[ \frac{\partial J}{\partial \theta} = \lim_{\varepsilon \to 0} \frac{J(\theta + \varepsilon) - J(\theta - \varepsilon)}{2 \varepsilon} \tag{1}\]
</p>

<p>
If you&rsquo;re not familiar with the &ldquo;\(\displaystyle \lim_{\varepsilon \to 0}\)&rdquo; notation, it&rsquo;s just a way of saying &ldquo;when \(\varepsilon\) is really really small.&rdquo;
</p>

<p>
We know the following:
</p>

<ul class="org-ul">
<li>\(\frac{\partial J}{\partial \theta}\) is what you want to make sure you&rsquo;re computing correctly.</li>
<li>You can compute \(J(\theta + \varepsilon)\) and \(J(\theta - \varepsilon)\) (in the case that \(\theta\) is a real number), since you&rsquo;re confident your implementation for \(J\) is correct.</li>
</ul>

<p>
<b><b>Note</b></b> 
</p>
<ul class="org-ul">
<li>Gradient Checking is slow! Approximating the gradient with \(\frac{\partial J}{\partial \theta} \approx  \frac{J(\theta + \varepsilon) - J(\theta - \varepsilon)}{2 \varepsilon}\) is computationally costly. For this reason, we don&rsquo;t run gradient checking at every iteration during training. Just a few times to check if the gradient is correct.</li>
<li>Gradient Checking, at least as we&rsquo;ve presented it, doesn&rsquo;t work with dropout. You would usually run the gradient check algorithm without dropout to make sure your backprop is correct, then add dropout.</li>
</ul>

<p>
Congrats, you can be confident that your deep learning model for fraud detection is working correctly! You can even use this to convince your CEO. :) 
</p>

<p>
<b><b>What you should remember from this notebook</b></b>:
</p>
<ul class="org-ul">
<li>Gradient checking verifies closeness between the gradients from backpropagation and the numerical approximation of the gradient (computed using forward propagation).</li>
<li>Gradient checking is slow, so we don&rsquo;t run it in every iteration of training. You would usually run it only to make sure your code is correct, then turn it off and use backprop for the actual learning process.</li>
</ul>
</div>
</div>
</div>
