course2reg.org
** Notes from the Python Notebook

**What you should remember**:
- The difference between gradient descent, mini-batch gradient descent and stochastic gradient descent is the number of examples you use to perform one update step.
- You have to tune a learning rate hyperparameter $\alpha$.
- With a well-turned mini-batch size, usually it outperforms either gradient descent or stochastic gradient descent (particularly when the training set is large).

The slice notation specifies a start and end value [start:end] and copies the list from start up to but not including end.

**What you should remember**:
- Shuffling and Partitioning are the two steps required to build mini-batches
- Powers of two are often chosen to be the mini-batch size, e.g., 16, 32, 64, 128.

**Note** that:
- The velocity is initialized with zeros. So the algorithm will take a few iterations to "build up" velocity and start to take bigger steps.
- If $\beta = 0$, then this just becomes standard gradient descent without momentum. 

**How do you choose $\beta$?**

- The larger the momentum $\beta$ is, the smoother the update because the more we take the past gradients into account. But if $\beta$ is too big, it could also smooth out the updates too much. 
- Common values for $\beta$ range from 0.8 to 0.999. If you don't feel inclined to tune this, $\beta = 0.9$ is often a reasonable default. 
- Tuning the optimal $\beta$ for your model might need trying several values to see what works best in term of reducing the value of the cost function $J$.

**What you should remember**:
- Momentum takes past gradients into account to smooth out the steps of gradient descent. It can be applied with batch gradient descent, mini-batch gradient descent or stochastic gradient descent.
- You have to tune a momentum hyperparameter $\beta$ and a learning rate $\alpha$.

* Week 3 Hyperparameter tuning, Regularization and Optimization
  
** Tuning Process

Soo many Hyperparameters! How to deal with them? 

\alpha is probably the most important. \beta can usually be set to 0.9. The numbers of layers and the learning rate decay (did we fix that parameter somewhere yet?) are also important. If you try out random values, don't use a grid-based strategy, instead really sample random values. Go from maybe coarser to progressively finer. 

** Appropriate Scale for Hyperparameters
   
Try random values on a log scale! e.g.

#+BEGIN_SRC python
r = -4 * np.random.rand()
alpha = 10**r
#+END_SRC

What about \beta? Usually $\beta \in [0.9 \dots 0.999]$. Sample $r \in [-3,-1]$, then $1-\beta = 10^r$.

** Hyperparameter Tuning in Practice: Pandas vs. Caviar

How to best divide up the limited resources? 

Babysitting one model (Panda approach) vs. training many models in parallel (Caviar strategy) 

** Normalizing Activations in a Network
   
Batch normalization was one of the most important developments. What is it? 

Remember that normalizing your input features can speed up learning. In a deeper model, you can normalize $z$ or $a$. Normalizing $z$ will be recommended.

Given some intermediate values $z^{[l](i)}$, normalize them!

$$z_{norm}^{(i)} = \frac{z^{[i)} - \mu}{\sqrt{\sigma^2 + epsilon}}$$

You don't always one mean zero and variance one but instead

$$\widetilde{z}^{(i)} = \gamma z^{(i)}_{norm} + \beta$$,

where \gamma and \beta are learnable parameters. Use $\widetilde{z}$ instead of $z$ to propagate further. 

** Fitting Batch Norm into a Neural Network

Batch norm step happens between computing $z$ and computing $a$, obviously. 

Parameters: $W^{[i]}, b^{[i]}, \beta^{[i]}, \gamma^{[i]}$. Update \beta and \gamma with gradient descent like you would with $W$ and $b$. Implementing batch norm is usually done through frameworks.

In practice, batch norm is done with mini-batches. That is, you update all the parameters after one mini-batch. 

Previously, we had $b$ as a parameter. But it will get canceled out by batch norm! So we just get rid of it. $\beta$ takes its function. 

How to implement? In each hidden layer, use batch norm to replace $Z^{[l]}$ with $\widetilde^{[l]}$. Use backprop to compute $dW^{[l]}, db^{[l]}, d\beta^{[l]}, d\gamma{[l]}$, but $b$ is in fact scrapped.

** Why does Batch Norm Work?

It's doing a similar thing to scaling your inputs, but on the level of activations. But that's only part of the reason. 

If your training set is very biased (e.g. black cats), so it doesn't generalize well to other sets (e.g. colored cats) with a /covariate shift/, this can pose a problem to your network. Basically, the underlying function changes. If you only look at say, the third hidden layer, then the activations of the previous layers are its input. But the inputs are changing all the time and are suffering from covariate shifts apparently. Batch norm counteracts this effect by ensuring that the mean and variance will remain somewhat constant governed by \beta and \gamma parameters. The earlier layers don't get to shift around as much. 

In addition, it adds some noise to each hidden layer's activations, providing a slight regularization effect. 

In total, it speed sup learning quite a bit.

** Batch Norm at Test Time

During training, you are processing batches. But what about test time where you might have only few examples?

Use \mu, \sigma^2 using exponentially weighted average across mini-batches. Save \mu and \sigma^2 values from mini-batches per layer. At test time, compute $z_{norm}$ with the exponentially weighted average of values from mini-batches. This process in practice is pretty robust. 

** Softmax Regression

Please note that in the next video at 4:30, the text for the softmax formulas mixes subscripts "j" and "i", when the subscript should just be the same (just "i") throughout the formula.

So the formula for softmax should be:
a[L]=eZL∑i=i4tia^{[L]} = \frac{e^{Z^{L}}}{\sum_{i=i}^{4} t_{i} }a[L]=∑i=i4​ti​
eZL​

So far, we just looked at binary clarification. Softmax regression is a generalization of logistic regression able to recognize any number of classes. 

$C$: #classes. 

Softmax gives you $P(y=i|x)$ for all output classes. 

In layer $L$, use the softmax activation function:

$$t = e^{z^{[L]}}: (4,1)$$
$$a^{[l]} = \frac{e^{Z^L}}{\sum_{i=1}^C t_i}$$

summarize as 

$$a^{[l]} = g^{[l]}(z^{[l]})$$

Unusual: takes (C,1) vector as input and outputs (C,1) vector, too. 

