course2reg.html

<div id="outline-container-orgb3dab38" class="outline-2">
<h2 id="orgb3dab38"><span class="section-number-2">3.</span> Week 2</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org08c56ce" class="outline-3">
<h3 id="org08c56ce"><span class="section-number-3">3.1.</span> Notes from the Python Notebook</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<b><b>What you should remember</b></b>:
</p>
<ul class="org-ul">
<li>The difference between gradient descent, mini-batch gradient descent and stochastic gradient descent is the number of examples you use to perform one update step.</li>
<li>You have to tune a learning rate hyperparameter \(\alpha\).</li>
<li>With a well-turned mini-batch size, usually it outperforms either gradient descent or stochastic gradient descent (particularly when the training set is large).</li>
</ul>

<p>
The slice notation specifies a start and end value [start:end] and copies the list from start up to but not including end.
</p>

<p>
<b><b>What you should remember</b></b>:
</p>
<ul class="org-ul">
<li>Shuffling and Partitioning are the two steps required to build mini-batches</li>
<li>Powers of two are often chosen to be the mini-batch size, e.g., 16, 32, 64, 128.</li>
</ul>

<p>
<b><b>Note</b></b> that:
</p>
<ul class="org-ul">
<li>The velocity is initialized with zeros. So the algorithm will take a few iterations to &ldquo;build up&rdquo; velocity and start to take bigger steps.</li>
<li>If \(\beta = 0\), then this just becomes standard gradient descent without momentum.</li>
</ul>

<p>
<b><b>How do you choose \(\beta\)?</b></b>
</p>

<ul class="org-ul">
<li>The larger the momentum \(\beta\) is, the smoother the update because the more we take the past gradients into account. But if \(\beta\) is too big, it could also smooth out the updates too much.</li>
<li>Common values for \(\beta\) range from 0.8 to 0.999. If you don&rsquo;t feel inclined to tune this, \(\beta = 0.9\) is often a reasonable default.</li>
<li>Tuning the optimal \(\beta\) for your model might need trying several values to see what works best in term of reducing the value of the cost function \(J\).</li>
</ul>

<p>
<b><b>What you should remember</b></b>:
</p>
<ul class="org-ul">
<li>Momentum takes past gradients into account to smooth out the steps of gradient descent. It can be applied with batch gradient descent, mini-batch gradient descent or stochastic gradient descent.</li>
<li>You have to tune a momentum hyperparameter \(\beta\) and a learning rate \(\alpha\).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6f849fe" class="outline-2">
<h2 id="org6f849fe"><span class="section-number-2">4.</span> Week 3 Hyperparameter tuning, Regularization and Optimization</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org5219bb7" class="outline-3">
<h3 id="org5219bb7"><span class="section-number-3">4.1.</span> Tuning Process</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Soo many Hyperparameters! How to deal with them? 
</p>

<p>
&alpha; is probably the most important. &beta; can usually be set to 0.9. The numbers of layers and the learning rate decay (did we fix that parameter somewhere yet?) are also important. If you try out random values, don&rsquo;t use a grid-based strategy, instead really sample random values. Go from maybe coarser to progressively finer. 
</p>
</div>
</div>

<div id="outline-container-org6ce08ae" class="outline-3">
<h3 id="org6ce08ae"><span class="section-number-3">4.2.</span> Appropriate Scale for Hyperparameters</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Try random values on a log scale! e.g.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #dcaeea;">r</span> = -<span style="color: #da8548; font-weight: bold;">4</span> * np.random.rand()
<span style="color: #dcaeea;">alpha</span> = <span style="color: #da8548; font-weight: bold;">10</span>**r
</pre>
</div>

<p>
What about &beta;? Usually \(\beta \in [0.9 \dots 0.999]\). Sample \(r \in [-3,-1]\), then \(1-\beta = 10^r\).
</p>
</div>
</div>

<div id="outline-container-org9780be9" class="outline-3">
<h3 id="org9780be9"><span class="section-number-3">4.3.</span> Hyperparameter Tuning in Practice: Pandas vs. Caviar</h3>
<div class="outline-text-3" id="text-4-3">
<p>
How to best divide up the limited resources? 
</p>

<p>
Babysitting one model (Panda approach) vs. training many models in parallel (Caviar strategy) 
</p>
</div>
</div>

<div id="outline-container-org6955b79" class="outline-3">
<h3 id="org6955b79"><span class="section-number-3">4.4.</span> Normalizing Activations in a Network</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Batch normalization was one of the most important developments. What is it? 
</p>

<p>
Remember that normalizing your input features can speed up learning. In a deeper model, you can normalize \(z\) or \(a\). Normalizing \(z\) will be recommended.
</p>

<p>
Given some intermediate values \(z^{[l](i)}\), normalize them!
</p>

<p>
\[z_{norm}^{(i)} = \frac{z^{[i)} - \mu}{\sqrt{\sigma^2 + epsilon}}\]
</p>

<p>
You don&rsquo;t always one mean zero and variance one but instead
</p>

<p>
\[\widetilde{z}^{(i)} = \gamma z^{(i)}_{norm} + \beta\],
</p>

<p>
where &gamma; and &beta; are learnable parameters. Use \(\widetilde{z}\) instead of \(z\) to propagate further. 
</p>
</div>
</div>

<div id="outline-container-orga14fb84" class="outline-3">
<h3 id="orga14fb84"><span class="section-number-3">4.5.</span> Fitting Batch Norm into a Neural Network</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Batch norm step happens between computing \(z\) and computing \(a\), obviously. 
</p>

<p>
Parameters: \(W^{[i]}, b^{[i]}, \beta^{[i]}, \gamma^{[i]}\). Update &beta; and &gamma; with gradient descent like you would with \(W\) and \(b\). Implementing batch norm is usually done through frameworks.
</p>

<p>
In practice, batch norm is done with mini-batches. That is, you update all the parameters after one mini-batch. 
</p>

<p>
Previously, we had \(b\) as a parameter. But it will get canceled out by batch norm! So we just get rid of it. \(\beta\) takes its function. 
</p>

<p>
How to implement? In each hidden layer, use batch norm to replace \(Z^{[l]}\) with \(\widetilde^{[l]}\). Use backprop to compute \(dW^{[l]}, db^{[l]}, d\beta^{[l]}, d\gamma{[l]}\), but \(b\) is in fact scrapped.
</p>
</div>
</div>

<div id="outline-container-orgbcab631" class="outline-3">
<h3 id="orgbcab631"><span class="section-number-3">4.6.</span> Why does Batch Norm Work?</h3>
<div class="outline-text-3" id="text-4-6">
<p>
It&rsquo;s doing a similar thing to scaling your inputs, but on the level of activations. But that&rsquo;s only part of the reason. 
</p>

<p>
If your training set is very biased (e.g. black cats), so it doesn&rsquo;t generalize well to other sets (e.g. colored cats) with a <i>covariate shift</i>, this can pose a problem to your network. Basically, the underlying function changes. If you only look at say, the third hidden layer, then the activations of the previous layers are its input. But the inputs are changing all the time and are suffering from covariate shifts apparently. Batch norm counteracts this effect by ensuring that the mean and variance will remain somewhat constant governed by &beta; and &gamma; parameters. The earlier layers don&rsquo;t get to shift around as much. 
</p>

<p>
In addition, it adds some noise to each hidden layer&rsquo;s activations, providing a slight regularization effect. 
</p>

<p>
In total, it speed sup learning quite a bit.
</p>
</div>
</div>

<div id="outline-container-orga2c00c9" class="outline-3">
<h3 id="orga2c00c9"><span class="section-number-3">4.7.</span> Batch Norm at Test Time</h3>
<div class="outline-text-3" id="text-4-7">
<p>
During training, you are processing batches. But what about test time where you might have only few examples?
</p>

<p>
Use &mu;, &sigma;<sup>2</sup> using exponentially weighted average across mini-batches. Save &mu; and &sigma;<sup>2</sup> values from mini-batches per layer. At test time, compute \(z_{norm}\) with the exponentially weighted average of values from mini-batches. This process in practice is pretty robust. 
</p>
</div>
</div>

<div id="outline-container-orgacfb86f" class="outline-3">
<h3 id="orgacfb86f"><span class="section-number-3">4.8.</span> Softmax Regression</h3>
<div class="outline-text-3" id="text-4-8">
<p>
Please note that in the next video at 4:30, the text for the softmax formulas mixes subscripts &ldquo;j&rdquo; and &ldquo;i&rdquo;, when the subscript should just be the same (just &ldquo;i&rdquo;) throughout the formula.
</p>

<p>
So the formula for softmax should be:
a[L]=eZL∑i=i4tia<sup>[L]</sup> = \frac{e<sup>Z<sup>L</sup></sup>}{&sum;<sub>i=i</sub><sup>4</sup> t<sub>i</sub> }a[L]=∑i=i4​ti​
eZL​
</p>

<p>
So far, we just looked at binary clarification. Softmax regression is a generalization of logistic regression able to recognize any number of classes. 
</p>

<p>
\(C\): #classes. 
</p>

<p>
Softmax gives you \(P(y=i|x)\) for all output classes. 
</p>

<p>
In layer \(L\), use the softmax activation function:
</p>

<p>
\[t = e^{z^{[L]}}: (4,1)\]
\[a^{[l]} = \frac{e^{Z^L}}{\sum_{i=1}^C t_i}\]
</p>

<p>
summarize as 
</p>

<p>
\[a^{[l]} = g^{[l]}(z^{[l]})\]
</p>

<p>
Unusual: takes (C,1) vector as input and outputs (C,1) vector, too. 
</p>
</div>
</div>
