course2reg.org
** Training a Softmax Classifier

Softmax comes from contrast to hard max. If $C=2$, softmax reduces to logistic regression. 

Loss function? Suppose that $C=4$ and

$$y = \begin{bmatrix}0 \\ 1 \\ 0 \\ 0 \end{bmatrix}, \hat{y} = \begin{bmatrix} 0.3 \\ 0.2 \\ 0.1 \\ 0.4 \end{bmatrix} $$

$$\mathcal{L}(\hat{y},y) = - \sum_{j=1}^C y_j\log{\hat{y}_j}$$

reduces to $-\log{\hat{y}_2}$. So larger $\hat{y}_2$ score better. This, btw, results in some form of maximum likelihood estimation. 

Then we have the matrix $Y$ as 

$$Y = [y^{(1)} \dots y^{(m)}] = \begin{bmatrix} 0 & \dots & 1 \\1 & \dots & 0 \\ 0 & \dots & 0 \\ 0 & \dots & 0   \end{bmatrix}: (4,m)$$

Then the derivative is

$$\frac{\partial}{dz^{[L]}}\mathcal{L} = \hat{y} - y: (4,1)$$

Usually, the frameworks take care for you of the backprop process. You need to get the forward pass right, though. Let's look at some!

** Deep Learning Frameworks

Good thing to learn to implement from almost scratch! Fortunately though, there are frameworks to help you along the way. 

Criteria for choice here:
- Ease of programming'
- Running speed
- Open source, good governance. How much do you trust that a framework will remain open source? 

** Tensorflow

Motivation:

$$J(w) = w^2 - 10w + 25$$

#+BEGIN_SRC python
  import numpy as np
  import tensorflow as tf
  w = tf.Variable(0,dtype=tf.float32)
  # cost = tf.add(tf.add(w**2,tf.multiply(-10.,w)),25)
  cost = w**2 - 10*w + 25
  train = tf.train.GradientDescentOptimizer(0.01).minimize(cost)
  init = tf.global_variables_initializer()
  session = tf.Session()
  session.run(init)
  print(session.run(w))
  for i in range(1000):
    session.run(train)
  print(session.run(w))
#+END_SRC

Add data now:
#+BEGIN_SRC python
  w = tf.Variable(0,dtype=tf.float32)
  x = tf.placeholder(tf.float32, [3,1])
  coefficients = np.array([[1.],[-10.], [25.]])
  cost = x[0][0]*w**2 + x[1][0]*w + x[2][0]
  train = tf.train.GradientDescentOptimizer(0.01).minimize(cost)
  init = tf.global_variables_initializer()
  session = tf.Session()
  session.run(init)
  print(session.run(w))
  for i in range(1000):
    session.run(train, feed_dict={x:coefficients})
  print(session.run(w))
#+END_SRC

A placeholder is a variable whose value you assign later. 

** Notes from the Notebook

We'll be using Tensorflow 1! But later also Keras, which is more similar to Tensorflow 2's syntax. 

Writing and running programs in TensorFlow has the following steps:

1. Create Tensors (variables) that are not yet executed/evaluated. 
2. Write operations between those Tensors.
3. Initialize your Tensors. 
4. Create a Session. 
5. Run the Session. This will run the operations you'd written above. 

Therefore, when we created a variable for the loss, we simply defined the loss as a function of other quantities, but did not evaluate its value. To evaluate it, we had to run `init=tf.global_variables_initializer()`. That initialized the loss variable, and in the last line we were finally able to evaluate the value of `loss` and print its value.

Great! To summarize, **remember to initialize your variables, create a session and run the operations inside the session**. 

**To summarize, you how know how to**:
1. Create placeholders
2. Specify the computation graph corresponding to operations you want to compute
3. Create the session
4. Run the session, using a feed dictionary if necessary to specify placeholder variables' values.

**What you should remember**:
- Tensorflow is a programming framework used in deep learning
- The two main object classes in tensorflow are Tensors and Operators. 
- When you code in tensorflow you have to take the following steps:
    - Create a graph containing Tensors (Variables, Placeholders ...) and Operations (tf.matmul, tf.add, ...)
    - Create a session
    - Initialize the session
    - Run the session to execute the graph
- You can execute the graph multiple times as you've seen in model()
- The backpropagation and optimization is automatically done when running the session on the "optimizer" object.
