course2reg.html

<div id="outline-container-org595dc1d" class="outline-3">
<h3 id="org595dc1d"><span class="section-number-3">4.9.</span> Training a Softmax Classifier</h3>
<div class="outline-text-3" id="text-4-9">
<p>
Softmax comes from contrast to hard max. If \(C=2\), softmax reduces to logistic regression. 
</p>

<p>
Loss function? Suppose that \(C=4\) and
</p>

<p>
\[y = \begin{bmatrix}0 \\ 1 \\ 0 \\ 0 \end{bmatrix}, \hat{y} = \begin{bmatrix} 0.3 \\ 0.2 \\ 0.1 \\ 0.4 \end{bmatrix} \]
</p>

<p>
\[\mathcal{L}(\hat{y},y) = - \sum_{j=1}^C y_j\log{\hat{y}_j}\]
</p>

<p>
reduces to \(-\log{\hat{y}_2}\). So larger \(\hat{y}_2\) score better. This, btw, results in some form of maximum likelihood estimation. 
</p>

<p>
Then we have the matrix \(Y\) as 
</p>

<p>
\[Y = [y^{(1)} \dots y^{(m)}] = \begin{bmatrix} 0 & \dots & 1 \\1 & \dots & 0 \\ 0 & \dots & 0 \\ 0 & \dots & 0   \end{bmatrix}: (4,m)\]
</p>

<p>
Then the derivative is
</p>

<p>
\[\frac{\partial}{dz^{[L]}}\mathcal{L} = \hat{y} - y: (4,1)\]
</p>

<p>
Usually, the frameworks take care for you of the backprop process. You need to get the forward pass right, though. Let&rsquo;s look at some!
</p>
</div>
</div>

<div id="outline-container-org46ddfa6" class="outline-3">
<h3 id="org46ddfa6"><span class="section-number-3">4.10.</span> Deep Learning Frameworks</h3>
<div class="outline-text-3" id="text-4-10">
<p>
Good thing to learn to implement from almost scratch! Fortunately though, there are frameworks to help you along the way. 
</p>

<p>
Criteria for choice here:
</p>
<ul class="org-ul">
<li>Ease of programming&rsquo;</li>
<li>Running speed</li>
<li>Open source, good governance. How much do you trust that a framework will remain open source?</li>
</ul>
</div>
</div>

<div id="outline-container-org861c3c5" class="outline-3">
<h3 id="org861c3c5"><span class="section-number-3">4.11.</span> Tensorflow</h3>
<div class="outline-text-3" id="text-4-11">
<p>
Motivation:
</p>

<p>
\[J(w) = w^2 - 10w + 25\]
</p>

<div class="org-src-container">
<pre class="src src-python">  <span style="color: #51afef;">import</span> numpy <span style="color: #51afef;">as</span> np
  <span style="color: #51afef;">import</span> tensorflow <span style="color: #51afef;">as</span> tf
  <span style="color: #dcaeea;">w</span> = tf.Variable(<span style="color: #da8548; font-weight: bold;">0</span>,dtype=tf.float32)
  <span style="color: #5B6268;"># </span><span style="color: #5B6268;">cost = tf.add(tf.add(w**2,tf.multiply(-10.,w)),25)</span>
  cost = w**<span style="color: #da8548; font-weight: bold;">2</span> - <span style="color: #da8548; font-weight: bold;">10</span>*w + <span style="color: #da8548; font-weight: bold;">25</span>
  train = tf.train.GradientDescentOptimizer(<span style="color: #da8548; font-weight: bold;">0.01</span>).minimize(cost)
  init = tf.global_variables_initializer()
  session = tf.Session()
  session.run(init)
  <span style="color: #c678dd;">print</span>(session.run(w))
  <span style="color: #51afef;">for</span> i <span style="color: #51afef;">in</span> <span style="color: #c678dd;">range</span>(<span style="color: #da8548; font-weight: bold;">1000</span>):
    session.run(train)
  <span style="color: #c678dd;">print</span>(session.run(w))
</pre>
</div>

<p>
Add data now:
</p>
<div class="org-src-container">
<pre class="src src-python">  <span style="color: #dcaeea;">w</span> = tf.Variable(<span style="color: #da8548; font-weight: bold;">0</span>,dtype=tf.float32)
  x = tf.placeholder(tf.float32, [<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">1</span>])
  coefficients = np.array([[<span style="color: #da8548; font-weight: bold;">1</span>.],[-<span style="color: #da8548; font-weight: bold;">10</span>.], [<span style="color: #da8548; font-weight: bold;">25</span>.]])
  cost = x[<span style="color: #da8548; font-weight: bold;">0</span>][<span style="color: #da8548; font-weight: bold;">0</span>]*w**<span style="color: #da8548; font-weight: bold;">2</span> + x[<span style="color: #da8548; font-weight: bold;">1</span>][<span style="color: #da8548; font-weight: bold;">0</span>]*w + x[<span style="color: #da8548; font-weight: bold;">2</span>][<span style="color: #da8548; font-weight: bold;">0</span>]
  train = tf.train.GradientDescentOptimizer(<span style="color: #da8548; font-weight: bold;">0.01</span>).minimize(cost)
  init = tf.global_variables_initializer()
  session = tf.Session()
  session.run(init)
  <span style="color: #c678dd;">print</span>(session.run(w))
  <span style="color: #51afef;">for</span> i <span style="color: #51afef;">in</span> <span style="color: #c678dd;">range</span>(<span style="color: #da8548; font-weight: bold;">1000</span>):
    session.run(train, feed_dict={x:coefficients})
  <span style="color: #c678dd;">print</span>(session.run(w))
</pre>
</div>

<p>
A placeholder is a variable whose value you assign later. 
</p>
</div>
</div>

<div id="outline-container-orgd0600b9" class="outline-3">
<h3 id="orgd0600b9"><span class="section-number-3">4.12.</span> Notes from the Notebook</h3>
<div class="outline-text-3" id="text-4-12">
<p>
We&rsquo;ll be using Tensorflow 1! But later also Keras, which is more similar to Tensorflow 2&rsquo;s syntax. 
</p>

<p>
Writing and running programs in TensorFlow has the following steps:
</p>

<ol class="org-ol">
<li>Create Tensors (variables) that are not yet executed/evaluated.</li>
<li>Write operations between those Tensors.</li>
<li>Initialize your Tensors.</li>
<li>Create a Session.</li>
<li>Run the Session. This will run the operations you&rsquo;d written above.</li>
</ol>

<p>
Therefore, when we created a variable for the loss, we simply defined the loss as a function of other quantities, but did not evaluate its value. To evaluate it, we had to run `init=tf.global<sub>variables</sub><sub>initializer</sub>()`. That initialized the loss variable, and in the last line we were finally able to evaluate the value of `loss` and print its value.
</p>

<p>
Great! To summarize, <b><b>remember to initialize your variables, create a session and run the operations inside the session</b></b>. 
</p>

<p>
<b><b>To summarize, you how know how to</b></b>:
</p>
<ol class="org-ol">
<li>Create placeholders</li>
<li>Specify the computation graph corresponding to operations you want to compute</li>
<li>Create the session</li>
<li>Run the session, using a feed dictionary if necessary to specify placeholder variables&rsquo; values.</li>
</ol>

<p>
<b><b>What you should remember</b></b>:
</p>
<ul class="org-ul">
<li>Tensorflow is a programming framework used in deep learning</li>
<li>The two main object classes in tensorflow are Tensors and Operators.</li>
<li>When you code in tensorflow you have to take the following steps:
<ul class="org-ul">
<li>Create a graph containing Tensors (Variables, Placeholders &#x2026;) and Operations (tf.matmul, tf.add, &#x2026;)</li>
<li>Create a session</li>
<li>Initialize the session</li>
<li>Run the session to execute the graph</li>
</ul></li>
<li>You can execute the graph multiple times as you&rsquo;ve seen in model()</li>
<li>The backpropagation and optimization is automatically done when running the session on the &ldquo;optimizer&rdquo; object.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: By Me</p>
<p class="date">Created: 2022-09-26 Mo 16:55</p>
</div>
</body>
</html>
